package Seminar3;
/*Реализовать алгоритм сортировки списков компаратором.
Пусть дан произвольный список целых чисел, удалить из него чётные числа
Задан целочисленный список ArrayList. Найти минимальное, максимальное и среднее из этого списка.
Дано два целочисленных списка, объеденить их не допуская элементы второго списка уже встречающиеся в первом.
Создать ArrayList<Integer> и добавить нулевым эллементом ноль 10000 раз.
Повторить пятый пункт но с LinkedList.
Сравнить время работы пятого и шестого пунктов.
Формат сдачи: файл с расширением java или ссылка на гит с подписанными ФИ и номером группы.
 */
public class Homework3 {
    
}
